---
type: CloudPoint
namespace: Autodesk.Revit.DB.PointClouds
version: 2024
members: 5
tags: [revit-api, class]
---

# CloudPoint

`Autodesk.Revit.DB.PointClouds.CloudPoint` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | CloudPoint | — | `public CloudPoint ( float x , float y , float z , int color )` |
| Field | Color | — | `public int Color` |
| Field | X | — | `public float X` |
| Field | Y | — | `public float Y` |
| Field | Z | — | `public float Z` |